class ButtonText:
    BACK = "⬅️ Назад"

    INITIAL_SELECTION = [
        "📚 Подробнее о нашем сервисе",
        "📘 Инструкция по пользованию",
        "💳 Оформить подписку",
        "🧾 Моя подписка",
        "📄 Конфиг",
        "⚙️  Настройки"
    ]

    CONTROL_PANEL = [
        "/admin",
        "📋 Посмотреть всех пользователей",
        "✏️ Изменить информацию о пользователе",
        "📂 Посмотреть конфиги пользователя",
        "🔍 Посмотреть свободные конфиги"
    ]

    SUBSCRIPTION_SETTINGS = [
        "🔄 Продлить подписку",
        "📦 Изменить конфиги"
    ]

    SUBSCRIPTION_RENEWAL = [
        "Продлить на 1 месяц",
        "Продлить на 2 месяца",
        "Продлить на 3 месяца",
        "🛒 Продлить подписку",
    ]

    SUBSCRIPTION_EDIT = [
        "➕ Увеличить количество",
        "➖ Уменьшить количество",
        
        "2 конфига докупить",
        "4 конфига докупить",
        "6 конфигов докупить", 
        "🛒 Докупить конфиги",

        "2 конфига удалить",
        "4 конфига удалить",
        "6 конфиов удалить",
        "🛒 Удалить конфиги"
    ]

    SYSTEM_SELECTION = [
        "mac os",
        "windows",
        "ios",
        "android"
    ]

    SUBSCRIPTION_SELECTION = [
        "2 устройства - 100р в месяц",
        "4 устройства - 200р в месяц",
        "6 устройств - 300р в месяц",
        "1 месяц",
        "2 месяца",
        "3 месяца",
        "🛒 Оформить подписку",
        "✅ Оплата совершена"
    ]

    PAYMENT_PROCESSING = [
        "❌ Недействительный",
        "✅ Действительный",
        "❌ Недействительный\n{id_telegram}",
        "✅ Действительный\n{id_telegram}",
        "event"
    ]
